# Terminal 
cask 'warp'
# Browser
cask "helium-browser"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Fast and simple Node.js version manager
brew "fnm"
# Simple terminal UI for git commands
brew "lazygit"
# Deep clean and optimize your Mac
brew "mole"
# Display and control your Android device
brew "scrcpy"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# vsCode 
cask "visual-studio-code"
vscode "biomejs.biome"
vscode "blazejkustra.react-compiler-marker"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.npm-intellisense"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "github.copilot-chat"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "openai.chatgpt"
vscode "oxc.oxc-vscode"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "vitest.explorer"
vscode "voidzero.vite-plus-extension-pack"
vscode "wayou.vscode-todo-highlight"
